const deck = [
    {
        deckName : '마법사 럭스',
        deckList : ['말자하','스웨인','벨코즈','소나','타릭','럭스','자르반4세','아리']
    },
    {
        deckName : '프렐요드 아크샨 리롤',
        deckList : ['소라카','애쉬','리산드라','아크샨','타릭','나서스','세주아니','크샨테']
    },
    {
        deckName : '백발백중 아펠리오스',
        deckList : ['애쉬','리산드라','아크샨','타릭','세주아니','쉔','아펠리오스','우르곳']
    },
    {
        deckName : '녹서스 다리우스 리롤',
        deckList : ['카시오페아','스웨인','클레드','다리우스','카타리나','나서스','아지르','사이온']
    },
    {
        deckName : '공허 카이사',
        deckList : ['말자하','초가스','카사딘','벨코즈','야스오','카이사','벨베스','크샨테']
    },
    {
        deckName : '자운 프렐요드 제리',
        deckList : ['애쉬','징크스','리산드라','에코','세주아니','우르곳','제리','사이온']
    },
    {
        deckName : '마법사 아리',
        deckList : ['스웨인','소나','카르마','타릭','럭스','쉔','자르반4세','아리']
    },
    {
        deckName : '기원자 카르마',
        deckList : ['갈리오','소라카','리산드라','카르마','타릭','쉔','라이즈','아리']
    },
    {
        deckName : '난동꾼 렉사이',
        deckList : ['레넥톤','초가스','바이','렉사이','리산드라','세주아니','카이사','사이온']
    },
    {
        deckName : '6도전자 칼리스타',
        deckList : ['사미라','이렐리아','워윅','칼리스타','그웬','쉔','야스오','카이사']
    },
]

export default deck