export const lineSynergyEffect = {
    공허: '전장에 놓을 수 있는 공허 알을 획득합니다. 전투 시작시 알이 말할 수 없는 공포로 부화해 주변 적들을 공중에 띄워 올립니다. 공허의 별 레벨이 오를수록 말할 수 없는 공포의 체력과 주문력이 25%씩 증가합니다.',
    그림자군도: '8번의 피해를 입히거나 받으면 그림자 군도 챔피언이 12초 동안 보호막을 얻고 전투가 끝날 때까지 유령 상태가 됩니다. 유령 챔피언은 매 초 마나를 회복합니다.',
    녹서스: '녹서스 챔피언은 체력, 주문력, 공격력을얻습니다. 해당 효과는 전투에서 정복하거나 탈락한 상대 한 명당 10% 증가합니다.',
    다르킨: '챔피언에게 옮겨 가고 5초 후 해당 챔피언이 사망하면 아트록스가 부활합니다.',
    데마시아: '가장 강한 아군 데마시아 유닛이 정예가 되어 매 전투에서 무작위 찬란한 아이템을 장착합니다. 정예 유닛은 자신과 주변 아군에게 방어력과 마법 저항력을 부여하지만, 이 효과는 중첩되지 않습니다.',
    방랑자: '',
    슈리마: '4초 마다 슈리마 유닛이 최대 체력의 5%만큼 회복합니다. 8초 후 선택한 슈리마 유닛이 초월해 최대 체력이 30%, 공격속도가 45% 증가합니다.',
    아이오니아: '각 아이오니아 유닛의 스킬에는 고유의 추가 효과가 있습니다. 4초마다 몇몇 아이오니아 유닛이 혼령 형태로 각성합니다. 각성 시 4초 동안 마나를 20 얻고 추가 능력치가 두 배가 됩니다.',
    요들: '아군이 별 레벨 하나당 공격 속도를 10% 얻습니다. 3성 챔피언이 3명이 있으면 아군 요들이 4성이 되어 스킬이 기묘하게 변화합니다! 장착 아이템 수가 같으면 최근에 배치된 요들이 선택됩니다.',
    자운: '자운 유닛은 자신들만 사용할 수 있는 무작위 화학공학 개조체를 생성합니다. 유닛은 하나의 개조체만 장착할 수 있으며, 개조체를 제거하려면 유닛을 판매해야 합니다.',
    타곤: '모든 아군 유닛의 체력 회복량과 보호막 흡수량이 증가합니다.',
    프렐요드: '8초 후에 전장에 얼음 폭풍이 붑니다. 적들은 최대 체력 비례 고정 피해를 입고 해로운 효과를 받습니다.',
    필트오버: 'T-헥스를 획득합니다. 플레이어 전투에서 패배할 때마다, T-헥스가 충전을 얻습니다. 승리 시 충전량이 동력으로 전환됩니다. T-헥스에 동력이 있을 경우 판매해서 T-헥스를 초기화하고 동력을 전리품으로 바꿀 수 있습니다.'
}

export const jobSynergyEffect = {
    구원자: '아군이 보호막을 얻을 때마다 세나가 해당 아군에게 전투가 끝날 때까지 공격 속도를 8% 부여합니다. 이 효과는 중첩됩니다. ',
    기원자: '3초마다 아군 유닛의 마나가 회복됩니다.',
    난동꾼: '아군 유닛이 체력을 100얻습니다. 난동꾼은 추가 최대 체력을 얻습니다.',
    도전자: '도전자는 추가 공격 속도를 얻습니다. 대상이 사망하면 새로운 대상에게 돌진하며 2.5초 동안 공격 속도 상승 효과가 50% 증가합니다.',
    마법사: '마법사는 추가 주문력을 얻습니다. 적이 마법사에게 피해를 입은 뒤 사망하면 자신의 최대 체력에 비례한 피해를 다른 적에게 입힙니다.',
    발명의대가: '',
    백발백중: '고유: 사거리 +1,3초마다 백발백중 유닛이 체력 비율이 가장 높은 적에게 기본 공격을 가해 추가 피해를 입힙니다.',
    불한당: '',
    사수: '사수 유닛이 기본 공격 시 추가 공격력을 얻습니다. (최대 8회 중첩)',
    여제: '공허 산호를 먹으면 2칸 내 적들에게 최대 체력의 10%에 해당하는 마법 피해를 입힙니다.',
    연쇄마법사: '연쇄마법사는 스킬을 여러 번 사용할 수 있습니다. 추가로 사용하는 스킬은 효과가 60% 감소합니다.',
    요새: '요새 챔피언이 방어력과 마법 저항력을 얻습니다. 이 효과는 전투 시작 후 10초 동안 100%만큼 증가합니다.',
    전쟁기계: '전쟁기계 챔피언은 체력이 낮아질수록 더 적은 피해를 받습니다.',
    책략가: '전투 시작: 전방 2열의 아군들이 15초 동안 보호막을 얻습니다. 후방 2열의 아군들이 주문력을 얻습니다.',
    학살자: '학살자가 15%의 모든 피해 흡혈을 얻습니다. 학살자는 추가 피해를 입힙니다. 체력이 75% 아래인 유닛에게는 추가 피해가 두 배로 증가합니다.'
}

export const synergyEnglishToKorean = {
    공허: 'Void',
    그림자군도: 'ShadowIsles',
    녹서스: 'Noxus',
    다르킨: 'Darkin',
    데마시아: 'Demacia',
    방랑자: 'Wanderer',
    슈리마: 'Shurima',
    아이오니아: 'Ionia',
    요들: 'Yordle',
    자운: 'Zaun',
    타곤: 'Targon',
    프렐요드: 'Freljord',
    필트오버: 'Piltover',
    구원자: 'Redeemer',
    기원자: 'Invoker',
    난동꾼: 'Bruiser',
    도전자: 'Challenger',
    마법사: 'Sorcerer',
    발명의대가: 'Technogenius',
    백발백중: 'Deadeye',
    불한당: 'Rogue',
    사수: 'Gunner',
    여제: 'Empress',
    연쇄마법사: 'Multicaster',
    요새: 'Bastion',
    전쟁기계: 'Juggernaut',
    책략가: 'Strategist',
    학살자: 'Slayer'
}


export const lineSynergyData = {
    공허: {
        explanation: {
            3: "공허 빨판상어",
            6: "협곡의 전령",
            8: "내셔 남작"
        },
        level: [1,3,4]
    },
    그림자군도: {
        explanation: {
            2: "40%의 보호막,매 초 5의 마나 획득",
            4: "80%의 보호막,매 초 5의 마나 획득",
            6: "125%의 보호막,매 초 5의 마나 획득"
        },
        level: [1,3,4]
    },
    녹서스: {
        explanation: {
            3: "추가 체력 160, 주문력 16, 공격력 16%",
            6: "추가 체력 300, 주문력 28, 공격력 28%",
            9: "추가 체력 500, 주문력 45, 공격력 45%"
        },
        level: [0,1,3,4]
    },
    다르킨: {
        explanation: {
            1: "아트록스 또는 다르킨의 검 장착 유닛이 사망하면 다르킨의 검이 가장 가까운 아군 챔피언에게 옮겨 가 400의 체력과 15%의 모든 피해 흡혈을 부여합니다."
        },
        level: [3]
    },
    데마시아: {
        explanation: {
            3: "정예 1명, 5의 방어력 및 마법 저항력",
            5: "정예 2명, 20의 방어력 및 마법 저항력",
            7: "정예 3명, 50의 방어력 및 마법 저항력",
            9: "정예 5명, 100의 방어력 및 마법 저항력"
        },
        level: [1,2,3,4]
    },
    방랑자: {
        explanation: {
            1: "라이즈의 스킬이 게임 시작 시 지역 차원문 투표 결과에 따라 변화합니다."
        },
        level: [3]
    },
    슈리마: {
        explanation: {
            3: "가장 강한 슈리마 유닛 초월",
            5: "모든 슈리마 유닛 초월",
            7: "전투 시작 시 초월, 초월 추가 효과 +20%",
            9: "2회 초월(전투 시작 시 및 8초 후), 초월 추가 효과 +25%"
        },
        level: [1,2,3,4]
    },
    아이오니아: {
        explanation: {
            3: "아이오니아 추가 효과 100%, 각성 1명",
            6: "아이오니아 추가 효과 200%, 각성 2명",
            9: "아이오니아 추가 효과 325%, 각성 3명"
        },
        level: [1,3,4]
    },
    요들: {
        explanation: {
            3: "가장 강한 아군 3성 요들",
            5: "3성 요들 2명"
        },
        level: [1,3]
    },
    자운: {
        explanation: {
            2: "화학공학 개조체 1개 획득",
            4: "화학공학 개조체 2개 획득",
            6: "과중천 효과가 부여된 화학공학 개조체 3개 획득"
        },
        level: [1,3,4]
    },
    타곤: {
        explanation: {
            2: "체력 회복량과 보호막 흡수량 +20% 증가",
            3: "체력 회복량과 보호막 흡수량 +40% 증가",
            4: "체력 회복량과 보호막 흡수량 +70% 증가"
        },
        level: [1,3,4]
    },
    프렐요들: {
        explanation: {
            2: "5% 체력 비례 피해, 10초 동안 적 40% 파열 및 파쇄",
            3: "10% 체력 비례 피해, 35%마나 강탈",
            4: "5% 체력 비례 피해, 1.5초 동안 적 기절"
        },
        level: [1,3,4]
    },
    필트오버: {
        explanation: {
            3: "T-헥스 획득",
            6: "매 라운드 추가 전리품 획득, 패배 시 2패로 간주"
        },
        level: [3,4]
    }
}

export const jobSynergyData = {
    구원자: {
        explanation: {
            1: "아군이 보호막을 얻을 때마다 세나가 해당 아군에게 전투가 끝날 때까지 공격 속도를 8% 부여합니다. 이 효과는 중첩됩니다. "
        },
        level: [3]
    },
    기원자: {
        explanation: {
            2: "5의 마나 회복",
            4: "기원자는 15 추가 회복",
            6: "모든 유닛이 20의 마나를 회복, 기원자는 추가 15 회복"
        },
        level: [1,2,3]
    },
    난동꾼: {
        explanation: {
            2: "최대 체력 +10%",
            4: "최대 체력 +35%",
            6: "최대 체력 +70%"
        },
        level: [1,2,3]
    },
    도전자: {
        explanation: {
            2: "공격속도 30%",
            4: "공격속도 60%",
            6: "공격속도 95%",
            8: "공격속도 140%"
        },
        level: [1,2,3,4]
    },
    마법사: {
        explanation: {
            2: "주문력 +25, 최대 체력의 10%에 해당하는 피해",
            4: "주문력 +50, 최대 체력의 10%에 해당하는 피해",
            6: "주문력 +80, 2명의 적에게 최대 체력의 12%에 해당하는 피해",
            8: "주문력 +120, 2명의 적에게 최대 체력의 20%에 해당하는 피해"
        },
        level: [1,2,3,4]
    },
    발명의대가: {
        explanation: {
            1: "업그레이드 슬롯이 3개 장착되고 전장에 놓을 수 있는 최첨단 포탑을 획득합니다. 포탑 업그레이드는 상점에서 6골드로 구매 가능합니다. 최첨단 포탑은 하이머딩거와 공격 속도 및 주문력을 공유합니다. 하나의 최첨단 포탑만 보유할 수 있습니다."
        },
        level: [3]
    },
    백발백중: {
        explanation: {
            2: "피해량 +20%",
            4: "피해량 +65%",
            6: "피해량 +140%"
        },
        level: [1,3,4]
    },
    불한당: {
        explanation: {
            2: "불한당의 체력이 50% 아래로 떨어지면 잠시 대상으로 지정할 수 없는 상태가 되어 4칸 내 적에게 돌진합니다.(후방 적 우선)",
            4: "또한 적에게 가하는 불한당의 첫 기본 공격이 출혈을 일으켜 5초 동안 대상 최대 체력의 30%에 해당하는 마법 피해를 입힙니다."
        },
        level: [1,3]
    },
    사수: {
        explanation: {
            2: "중첩당 공격력 6%",
            4: "중첩당 공격력 11%",
            6: "중첩당 공격력 20%"
        },
        level: [1,3,4]
    },
    여제: {
        explanation: {
            1: "벨베스가 적을 처치하면 벨베스가 먹을 수 있는 공허 산호가 떨어집니다. 첫 공허 산호는 벨베스의 최대 체력을 50% 증가시키며, 이후로는 최대 체력의 20%씩 증가시킵니다."
        },
        level: [3]
    },
    연쇄마법사: {
        explanation: {
            2: "추가 사용 1회",
            4: "추가 사용 2회"
        },
        level: [1,3]
    },
    요새: {
        explanation: {
            2: "방어력 및 마법 저항력 +20",
            4: "방어력 및 마법 저항력 +50",
            6: "방어력 및 마법 저항력 +100",
            8: "방어력 및 마법 저항력 +240"
        },
        level: [1,2,3,4]
    },
    전쟁기계: {
        explanation: {
            2: "피해량 감소 15%~25%",
            4: "피해량 감소 25%~35%",
            6: "피해량 감소 35%~50%"
        },
        level: [1,2,3]
    },
    책략가: {
        explanation: {
            2: "보호막 200, 주문력 20획득",
            3: "보호막 350, 주문력 30획득",
            4: "보호막 500, 주문력 50획득",
            5: "보호막 800, 주문력 70획득"
        },
        level: [1,2,3,4]
    },
    학살자: {
        explanation: {
            2: "추가 피해 +5%",
            3: "추가 피해 +10%",
            4: "추가 피해 +20%",
            5: "추가 피해 +30%",
            6: "추가 피해 +40%"
        },
        level: [1,2,2,3,4]
    }
}